#+TITLE: Go Concurrency Patterns Pipelines And Cancellation
#+DATE: 2020-08-15

#+EXPORT_FILE_NAME: go-concurrency-patterns-pipelines-and-cancellation
#+HUGO_WEIGHT: auto
#+HUGO_BASE_DIR: ~/G/blog
#+HUGO_AUTO_SET_LASTMOD: t
#+HUGO_SECTION: notes
#+HUGO_CATEGORIES: notes
#+HUGO_TAGS: golang concurrency goroutine

Original Post:
#+begin_quote
-> [[https://blog.golang.org/pipelines][Go Concurrency Patterns: Pipelines and cancellation - The Go Blog]]
#+end_quote

* Squaring numbers

Consider a pipeline with three stages.

The first stage, ~gen~, is a function that converts a list of integers to a
channel that emits the integers in the list. The gen function starts a goroutine
that sends the integers on the channel and closes the channel when all the
values have been sent.

The second stage, sq, receives integers from a channel and returns a channel
that emits the square of each received integer. After the inbound channel is
closed and this stage has sent all the values downstream, it closes the outbound
channel.

#+BEGIN_SRC go :exports both :imports "fmt"
func gen(nums ...int) <-chan int {
	out := make(chan int)
	go func() {
		for _, n := range nums {
			out <- n
		}
		close(out)
	}()
	return out
}

func sq(in <-chan int) <-chan int {
	out := make(chan int)
	go func() {
		for n := range in {
			out <- n * n
		}
		close(out)
	}()
	return out
}

func main() {
	// Set up the pipeline and consume the output.
	numlines := sq(sq(gen(2, 3, 4)))
	for n := range numlines {
		fmt.Println(n)
	}
}
#+END_SRC

#+RESULTS:
: 16
: 81
: 256

